Art_Share_API/app/controllers/artworks_controller.rb

    def create #create ...follow class[...]
        # debugger
        x = Artwork.new(artworks_params)
        if x.save #want to return false
---
INSERT INTO "artworks" ("title", "artist_id") VALUES ($1, $2) RETURNING "id"  [["title", "cats are cuter"], ["artist_id", 10]]